[
  {
    "manifestVersion": 1,
    "id": "affine",
    "name": "Affine",
    "category": "files",
    "version": "0.25.1",
    "port": 3013,
    "description": "A privacy-focused, local-first, open-source, and ready-to-use alternative for Notion & Miro. One hyper-fused platform for wildly creative minds.\n\nTo Shape, not to adapt. Tools can impact your lifestyle. AFFiNE is built for individual & teams who care their data, who refuse vendor lock-in, and who want to have control over their essential tools.\n\n🛠️ SET-UP INSTRUCTIONS\nIn order to save your data, you need to sign in to your self-hosted Affine instance:\n\n1. When you first open Affine, it will walk you through setting up an admin account.\n2. After setting up your admin account, close the browser window and open up the Affine app again from the umbrelOS homescreen.\n3. In the Affine app select the Demo Workspace from the sidebar and then select \"Create cloud workspace\"\n4. Follow the steps to create your self-hosted cloud workspace. You are now ready to use Affine with your self-hosted instance!",
    "gallery": [
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/affine/icon.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/affine/image1.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/affine/image2.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/affine/image3.png"
    ],
    "architectures": [
      "amd64",
      "arm64"
    ]
  },
  {
    "manifestVersion": 1,
    "id": "node-red",
    "category": "automation",
    "name": "Node-RED",
    "version": "4.1.1",
    "description": "Node-RED is a visual programming tool for wiring together hardware devices, APIs and online services in new and interesting ways.\n\nIt provides a browser-based editor that makes it easy to wire together flows using the wide range of nodes in the palette that can be deployed to its runtime in a single-click. A built-in library allows you to save useful functions, templates or flows for re-use.\n\nThe flows created in Node-RED are stored using JSON which can be easily imported and exported for sharing with others. An online flow library allows you to share your best flows with the world.\n\nNote: If you would like your 'HTTP In' nodes to be accessible without authentication, then prepend your url with '/public/'. E.g. /public/do-something",
    "developer": "OpenJS Foundation",
    "website": "https://nodered.org",
    "dependencies": [
      "bitcoin",
      "electrs",
      "lightning"
    ],
    "repo": "https://github.com/node-red/node-red",
    "support": "https://nodered.org/about/community/slack/",
    "port": 1880,
    "gallery": [
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/node-red/icon.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/node-red/image1.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/node-red/image2.png",
      "https://cdn.jsdelivr.net/gh/Loghin01/ryvie-apps-gallery@main/node-red/image3.png"
    ]
  }
]
